Repository: PeriklisP/django-collaborative
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: tag
es: etiqueta

source: Duplicate header column '%s' found. Please rename the column in your source spreadsheet and continue again, below.
es: El nombre de la columna '%s' aparece dos veces. Dé otro nombre a la columna en la hoja de cálculo original e intente de nuevo.

source: Data source '%s' already exists. Please choose another name or re-import the existing data source from the administration panel.
es: La fuente de datos '%s' ya existe. Elija otro nombre o importe nuevamente de la fuente original en el panel de administración.

source: We can't find a valid CSV from the URL provided. If this is a Google Sheet, make sure you copied the share link. If it's a private sheet, make sure you used the private sheet checkbox, have uploaded a credential file, and shared the sheet with the service account email. Otherwise, make sure there are no typos or errors in your URL.
es: No se encuentra un CSV válido en este enlace. Si este enlace es una hoja de cálculo de Google, asegúrese que copió el enlace de compartir el documento. Si es una hoja privada, verifique que marcó la caja para hojas privadas, que subió el archivo de credenciales y compartió la hoja con el correo de la cuenta de servicio. De otra manera, verifique que no haya erratas o errores en el enlace.

source: We couldn't find any private Google sheet credentials saved. If you intended to import a private sheet, please make sure you went through the instructions for getting credentials and upload them upon import. If you need to re-upload credentials, you can do so via the 'Configure Google Credentials' link at the top of the Collaborate dashboard.
es: No se encuentra una hoja de cálculo de Google con credenciales guardadas. Si quiso importar una hoja privada, asegúrese que revisó las instrucciones para conseguir las credenciales y subirlas aquí. Si necesita subir las credenciales de nuevo, puede subirlas en la sección 'Configure Credenciales de Google' en la parte superior del tablero de control en Collaborate.

source: Columns in a spreadsheet
es: Columnas en una hoja de cálculo

source: Successful Import
es: Importación exitosa

source: Successful Imports
es: Importaciones exitosas

source: Run the selected action
es: Ejecutar la acción seleccionada

source: Go
es: Ir

source: Click here to select the objects across all pages
es: Haga click aquí para seleccionar los objetos en todas las páginas

source: Select all %(total_count)s %(module_name)s
es: Limpiar selección

source: Data Source Label
es: Nombre del proyecto

source: Google Sheet URL
es: URL de hoja de cálculo de Google

source: Show Private Sheet Setup Instructions
es: Mostrar instrucciones para configuración de hojas privadas

source: Credentials File
es: Archivo de credenciales

source: API key
es: Clave API

source: Project ID
es: ID del Proyecto

source: Form ID (optional)
es: ID del Formulario (opcional)

source: Continue
es: Continuar

source: Home
es: Inicio

source: Re-import
es: Reimportar

source: Export
es: Exportar

source: Please correct the error below.
es: Corrija el error abajo.

source: Please correct the errors below.
es: Corrija los errores abajo.

source: Filter
es: Filtrar

source: A duplicate header column, <code>%(name)s</code>, was found. Please rename the column in your source spreadsheet and continue again (below).
es: El nombre de la columna, <code>%(name)s</code>, aparece dos veces. Cambie nombre a la columna en la hoja de cálculo original e intente de nuevo (abajo).

source: Data source %(name)s already exists. Please choose another name or re-import the existing data source from the
es: La fuente de datos %(name)s ya existe. Escoja otro nombre o haga la reimportación de la fuente original en el

source: administration panel
es: panel de administración

source: Google redactions credentials missing.
es: No hay credenciales para que Google oculte información sensible

source: In order to use Google redaction, you need to set it up from the Configure Google Credentials page. Click here to open the page in a new tab
es: Para que Google oculte la información sensible, debe hacer la configuración en la página de credenciales de Google. Haga clic aquí para abrir la página en una pestaña nueva.

source: Max length (characters)
es: Extensión máxima (caracteres)

source: e.g., 120
es: ej., 120

source: Choices (comma separated)
es: Selecciones (separado por comas)

source: e.g., option-1, option-2
es: ej., opción-1, opción-2

source: If you delete a field here, anything you've entered into that field will be lost.
es: Si elimina un campo aquí, la información en este campo se va perder.

source: Metadata
es: Metadatos

source: Metadata fields allow you to annotate, tag and enhance your imported data. The first two fields will be displayed in imported records list, before other imported data fields.
es: Los campos de metadatos le permite a anotar, etiquetar y mejorar los datos importados. Puede encontrar los primeros dos campos en la lista de registros importados, antes de los otros campos de datos importados.

source: Contact Log/History
es: Registro de Contacto/Historial

source: The contact log lets you maintain an ordered record of information related to your imported rows. This can be used for keeping track of contact with sources or investigation progress. These fields will not be shown in the imported records list, but will be available on the individual record page.
es: El historial le permite mantener un registro ordenado de información relacionada a las filas importadas. Se puede usar para dar seguimiento con las fuentes o al progreso de la investigación. Estos campos no se ven en la lista de registros importados, pero están disponibles en la página del registro individual.

source: These are the columns we found in your sheet. Feel free to change the data types or set fields you want to search, filter or redact.
es: Identificamos estas columnas en la hoja importada. Puede cambiar los tipos de datos y los campos que quiere buscar, filtrar o clasificar.

source: The first five columns (below) will be displayed in the imported records list. The remaining columns will only be shown inside each record's full detail page. Re-order the columns by dragging them around.
es: Se mostrarán las primeras cinco columnas (abajo) en la lista de los registros importados. Se puede ver las otras columnas sólo en la página de un registro individual. Se pueden reordenar las columnas arrastrándolas hacia donde las quiere colocar.

source: In order to use redaction on your columns, you need to
es: Para proteger la información de ocultar y clasificar las columnas, hay que

source: set up Google Cloud Data Loss Prevention credentials here.
es: configurar las credenciales de Google Cloud Data Loss Prevention.

source: When you are done, refresh the page.
es: Cuando termine, actualice la página.

source: System is loading, please wait...
es: El sistema está cargando, espere por favor...

source: You will be redirected once this is complete. If you are not redirected shortly, please <a id="nextPage" href="%(next)s">click here</a>.
es: Una nueva página aparecerá cuando este proceso termine. Si no aparece en breve, <a id="nextPage" href="%(next)s">haga clic aquí</a>.

source: Invalid Google Sheets share URL
es: URL de hojas de cálculo Google no válido

source: Error importing from CSV URL.
es: Error de importación del CSV.

source: Bad URL or permission denied to sheet.
es: La URL no funciona o el permiso a la hoja fue negada.

source: A column is missing required field: %s
es: Una columna falta el campo obligatorio: %s

source: A column contains invalid field: %s
es: Una columna contiene un campo no válido: %s

source: Column attributes must be a dictionary
es: Los atributos de la columna deben ser un diccionario.

source: Invalid data source. Please make sure you linked to a valid CSV data source.
es: La fuente de datos no es válida. Verifique que la URL contenga una fuente válida.

source: Invalid URL. Please make sure there aren't typos in the URL, and that the data isn't protected. If you're trying to use a protected Google Sheet, you need to use the private Sheet authenticator, below.
es: La URL no es válida. Verifique que no haya erratas en la URL y que los datos no son privados. Si quiere usar una hoja de Google privada, hay que usar el autenticador de hojas privadas abajo.

source: If you are creating a user for logging in via Google Sign In, add their email address as their username, below. You do not need to add a password. An unusable password will be created if you leave it blank. Otherwise, create a username and password and provide it to your user if you're not using Google Sign In.
es: Si desea crear un usuario para iniciar sesión via Google Sign In, agregue abajo su correo como su nombre de usuario. No hay que agregar una contraseña. Una contraseña que no se puede usar será creada si deja este campo en blanco. Si no quiere usar Google Sign In, puede crear un nombre de usuario y contraseña y pasarlos al usuario.

source: Enter a username and password.
es: Ingrese un nombre de usuario y una contraseña.

source: Add new data source
es: Agregue una nueva fuente de datos

source: Configure Google Services
es: Configurar Servicios de Google

source: Django administration
es: Configuración de Django

source: Add %(name)s
es: Agregue %(name)s

source: No data sources added. Import one here.
es: No hay fuentes de datos importadas. Agregue datos aquí.

source: Models in the %(name)s application
es: Modelos en la aplicación %(name)s

source: Delete
es: Borrar

source: Delete an Import
es: Borrar una importación

source: Add
es: Agregar

source: View Records
es: Ver Registros

source: View
es: Ver

source: Change
es: Cambiar

source: You don't have permission to view or edit anything.
es: No tiene permiso para ver o editar nada.

source: Recent actions
es: Acciones recientes

source: My actions
es: Mis acciones

source: None available
es: No hay nada disponible

source: Unknown content
es: Contenido desconocido

source: I want to use social sign in
es: Quiero ingresar usando Google OAuth

source: Or, sign in with a password
es: O ingrese con una contraseña

source: You are authenticated as %(username)s, but are not authorized to access this page. Would you like to login to a different account?
es: Está autenticado como %(username)s, pero no tiene permiso para acceder a esta página. ¿Quiere ingresar con otra cuenta?

source: You are about to set up the system and add data sources. But first, please log in with the default username and password.
es: Antes de configurar el sistema y agregar fuentes de datos, inicie la sesión con el nombre de usuario y la contraseña predeterminados.

source: Forgotten your password or username?
es: ¿Olvidó su nombre de usuario o contraseña?

source: Log in
es: Iniciar sesión

source: Congratulations, you've successfully configured Collaborate. Clicking below will complete the process, bringing you the login screen. </p> <p> From there, you can manage your imported data and add users. Good luck! </p>
es: ¡Felicidades! Ha configurado Collaborate exitosamente. Al hacer clic abajo completará el proceso, y llegará a la página de inicio. </p> <p> Desde esa página, puede configurar los datos importados y agregar usuarios. ¡Buena suerte! </p>

source: Google Credentials Setup
es: Configuración de Credenciales de Google

source: Google Credentials
es: Credenciales de Google

source: Google provides several services that can be integrated into Collaborate. In order to enable them, you first need to set up each one by following the provided instructions.
es: Google provee varios servicios que se puede usar con Collaborate. Para activarlos, hay que configurar cada uno siguiendolas instrucciones disponibles.

source: In order to allow users to sign in with their Google account, you need to request access from Google to do this. Specifically, you need something called OAuth2 keys from Google. To get these keys, follow these steps:
es: Para permitir ingresar usuarios con su cuenta de Google, debe solicitar el acceso desde Google. Específicamente, requiere las claves OAuth2 de Google. Para conseguirlas, siga los siguientes pasos:

source: Go to the Google Developer's Console
es: Vaya al panel de control de Google Developers.

source: Create a new project (or select an existing one).
es: Cree un proyecto nuevo (o seleccione un proyecto existente).

source: On the left, select "Credentials"
es: En el lado izquierdo, seleccione "Credenciales"

source: Select the "OAuth consent screen"
es: Seleccione la página "Consentimiento de OAuth"

source: Give your application a name and support email. Click "Save" at the bottom
es: Escriba un nombre para su aplicación y un correo. Haga clic en "Guardar" en la parte de abajo

source: Go back to the "Credentials" tab. Click "Create credentials" &rarr; "OAuth client ID"
es: Vaya de nuevo a la página de "Credenciales". Haga clic en "Crear credenciales" &rarr; "ID de cliente de OAuth"

source: Select "Web application". This will expose more options.
es: Seleccione "Aplicación de web". Aparecerán más opciones.

source: Under "Authorized JavaScript origins" enter:
es: Abajo de "Origenes autorizadas de JavaScript" ingrese:

source: Under "Authorized redirect URIs" enter:
es: Abajo de "Redirect URIs autorizados" ingrese:

source: Click "Save".
es: Haga clic en "Guardar".

source: This will bring up a prompt containing the Google OAuth2 Key and Secret. Copy each to the below input boxes.
es: Una ventana aparecerá con la clave y secreto de Google OAuth2. Copie los dos, y vuelva a Collaborate. Péguelos en las cajas abajo.

source: Optionally, you can select one or more domains to whitelist. This will let users whose email addresses are within the whitelisted domain sign in, without needing to first create their user account.
es: Puede elegir colocar un dominio o varios dominios en la lista blanca. Esto permitirá que usuarios con correos en esos dominios puedan ingresar, sin la necesidad de crear una cuenta nueva.

source: If you didn't whitelist any domains, you'll need to pre-create each user that you want to be able sign in via Google Sign In. This can be done from the users section of the admin dashboard.
es: Si no colocó un dominio en la lista blanca, hay que crear cada usuario a los que permitirá ingresar usando Google Sign In. Puede hacer este proceso en la sección de usuarios de Collaborate.

source: Google OAuth2 Client ID
es: ID de Cliente de Google OAuth2

source: Google OAuth2 Secret
es: Secreto de Google OAuth2

source: Whitelist Domains (Optional)
es: Dominios en la Lista Blanca (Opcional)

source: To have the app automatically redact personally identifiable information (names, phone numbers, email addresses, etc) upon import from a spreadsheet, you can use the Google Data Loss Prevention (DLP) service. This requires you to create a DLP credentials file and setting up a billing account with Google, by following the instructions below.
es: Para clasificar información personal de manera automática (nombres, números de teléfono, correos, etc) al importar desde una hoja de cálculo, puede usar el servicio de Google Data Loss Prevention (DLP). Debe crear un archivo de credenciales DLP y configurar una cuenta de facturación con Google. Siga las instrucciones abajo.

source: Note: This will not remove the information from the source data. This will only prevent it from being saved to Collaborate's database.
es: Ojo: Este paso no quitará la información de los datos originales. Esto sólo evitará que se salve en la base de datos de Collaborate.

source: Credentials file
es: Archivo de credenciales

source: To grant Collaborate access to private sheets, you need to follow the instructions below and upload the Google credentials file.
es: Para conceder acceso a las hojas privadas, debe seguir los siguientes pasos abajo y subir el archivo de credenciales de Google.

source: If you've already gone through these steps (if you already imported a private Google spreadsheet), you don't need to go through them again. If you need to re-upload credentials, you can do it here.
es: Si ya terminó este proceso (ya importó una hoja privada), no hay que repetirlo. Si necesita subir las credenciales de nuevo, puede hacerlo aquí.
